read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_pbk_slvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_pbk_slvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_pbk_rvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_pbk_lvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_pbk_lvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_pbk_rvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_cdk12m3mx2fx7dx_slvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dt_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_lvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_lvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_rvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_rvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_slvt_c54l04_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_slvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn

read_verilog ./inputs/buffer_chain.v
link_design buffer_chain

read_sdc ./inputs/buffer_chain.sdc
read_spef /proj_pd/user_dev/rsrivastava/mlpd/unitTests/bufferChain/workarea/dreamplace1/outputs/buffer_chain.gp.spef.gz
set sta_report_default_digits 4
set sta_continue_on_error 1

report_checks -path_delay max -format full_clock_expanded -fields {capacitance slew input_pins net fanout} -endpoint_path_count 100 > buffer_chain.setup.rpt
