 read_liberty /proj_pd/ML4PD/dreamplace/libs/ln04lpp_sc_s6p25t_flk_slvt_c54l06_tt_nominal_max_0p7500v_85c_lvf_dth_parsed.lib_ccs_tn
 read_verilog vedic_filter.vg
 link_design vedic_16x16
 create_clock -name clk -period 0.4 {clk}
 report_checks

